const questions = [
  {
    id: 1,
    question: "رجل طلب من الاخصائي النفسي معلومات عن حالة زوجته التي تراجع عنده. ماذا يفعل الاخصائي؟",
    options: [
      "يعطيه بعض المعلومات الأولية",
      "يعطيه جميع المعلومات عن الحالة",
      "حول طلب الرجل إلى الإدارة",
      "يطلب من الرجل موافقة خطية من زوجته"
    ],
    correctAnswer: 3
  },
  {
    id: 2,
    question: "أي من العبارات التالية تصف مفهوم 'العرق' بشكل أدق؟",
    options: [
      "العرق مفهوم اجتماعي",
      "العرق بيولوجي",
      "الإثنية أنسب من العرق",
      "يُستخدم مصطلح الأقلية بدلاً من العرق"
    ],
    correctAnswer: 0
  },
  {
    id: 3,
    question: "أي من التالي يصف بشكل أدق الفرق بين 'الشخصية السلطوية' و'الشخصية المستبدة'؟",
    options: [
      "الشخصية السلطوية تظهر عاطفة، أما المستبد فلا يظهر عاطفة",
      "الشخصية السلطوية لا تظهر عاطفة، أما المستبد فيظهر عاطفة",
      "كل من السلطوية والمستبدة تظهران عاطفة بشكل متساوٍ",
      "لا توجد فروق في التعبير العاطفي بين السلطوية والمستبدة"
    ],
    correctAnswer: 1
  },
  {
    id: 4,
    question: "ما المفهوم الذي يصف تصرف شخص يربط فشل مشروع بخطأ شخصي ويضخم المشكلة؟",
    options: [
      "التهويل (Exaggeration)",
      "التصغير (Underestimation)",
      "التجاهل (Ignoring)",
      "التبرير (Justification)"
    ],
    correctAnswer: 0
  },
  {
    id: 5,
    question: "رجل جاء إلى العيادة يعاني من هياج بعد حادث سيارة وأصبح بحاجة لمساعدة من أهله، ما هو التشخيص؟",
    options: [
      "اضطراب ذهني بسبب إصابة رضية بدون اضطراب سلوك",
      "اضطراب ذهني بسبب إصابة رضية مع اضطراب سلوك",
      "إعاقات ذهنية ناتجة عن أسباب أخرى",
      "اضطراب نفسي حاد غير مرتبط بالإصابة"
    ],
    correctAnswer: 1
  },
  {
    id: 6,
    question: "شخص تعرض لإصابة دماغية ولكن لا تؤثر على استقلاليته، ما هو التشخيص؟",
    options: [
      "اضطراب عصبي معرفي طفيف (Mild Neurocognitive Disorder)",
      "اضطراب عصبي معرفي شديد (Severe Neurocognitive Disorder)",
      "اضطراب ذاكرة مؤقت (Transient Memory Disorder)",
      "اضطراب نفسي حاد (Acute Psychiatric Disorder)"
    ],
    correctAnswer: 0
  },
  {
    id: 7,
    question: "أثناء مناسبة، رأى الأخصائي أحد المراجعين. ماذا يفعل؟",
    options: [
      "يغادر المكان فوراً",
      "يذهب للعميل ويبادر بالسلام عليه",
      "لا يذهب إليه لكن لو أتى العميل للسلام لا بأس"
    ],
    correctAnswer: 2
  },
  {
    id: 8,
    question: "أثناء الجلسة، اكتشفت الأخصائية أن المراجعة هي والدة صديقتها. ما التصرف المهني الأنسب؟",
    options: [
      "تتابع الجلسات كالمعتاد مع المحافظة على الخصوصية",
      "تحوّل الحالة إلى أخصائية أخرى تجنبًا لتضارب المصالح",
      "تستشير المشرف المهني أو الفريق العلاجي لاتخاذ القرار المناسب",
      "تتوقف عن تقديم الخدمة فورًا دون توضيح السبب للمراجعة"
    ],
    correctAnswer: 1
  },
  {
    id: 9,
    question: "عميل عزم الأخصائي على وجبة عشاء في مطعم فاخر. ماذا يفعل الأخصائي؟",
    options: [
      "أرفض",
      "أوافق",
      "أوافق بشرط كل شخص يدفع تكاليف وجبته"
    ],
    correctAnswer: 0
  },
  {
    id: 10,
    question: "عميل قال للأخصائي أنه سينتحر. ما الإجراء الصحيح؟",
    options: [
      "أحوله لأخصائي آخر",
      "أبلغ أهله والجهات المسؤولة أثناء الجلسة فوراً",
      "أوعده ما يفكر بالانتحار",
      "أوقعه على تعهد بعدم الانتحار"
    ],
    correctAnswer: 1
  },
  {
    id: 11,
    question: "عميل قال بأنه سبق وسرق وتاب وهو الآن زعلان، ما التصرف الأنسب؟",
    options: [
      "أبلغ الشرطة",
      "أطرده من العيادة",
      "التقبل"
    ],
    correctAnswer: 2
  },
  {
    id: 12,
    question: "اخصائي نفسي إرشادي جاته حالة طارئة في تخصص غير تخصصه، ماذا يفعل؟",
    options: [
      "يمسك الحالة ويطبق عليه المقاييس ويكمل معاها العلاج",
      "يعتذر من العميل ويخبره بأن تخصصه لا يتوافق",
      "يمسك الحالة مؤقتا إلى أن يأتي الأخصائي المناسب"
    ],
    correctAnswer: 2
  },
  {
    id: 13,
    question: "عميل يسقط في المدينة التي ينتمي لها الأخصائي ويذم أهلها، ماذا يفعل؟",
    options: [
      "يوضح للعميل بأن هذا الكلام غير صحيح",
      "يحول الحالة إلى أخصائي آخر",
      "يتقبل العميل",
      "يوضح للعميل أنه من نفس المدينة ويطلب الاعتذار"
    ],
    correctAnswer: 2
  },
  {
    id: 14,
    question: "شاب عمره 30 عامًا يعاني من نوبات اكتئاب حادة تستمر أسبوعين أو أكثر، ما التشخيص؟",
    options: [
      "اكتئاب جسيم",
      "اكتئاب موسمي",
      "اكتئاب دوري",
      "اكتئاب مستمر"
    ],
    correctAnswer: 0
  },
  {
    id: 15,
    question: "فتاة طلبت من الأخصائي أن يقيم علاقة عاطفية معها لتساعدها على العلاج، ماذا يفعل؟",
    options: [
      "يرفض العلاقة لأنها ليست من أخلاقيات المهنة",
      "يستمر فيها مع التزام الصمت",
      "يخبر أهلها",
      "يخبر رئيس القسم"
    ],
    correctAnswer: 0
  },
  {
    id: 16,
    question: "نقص هرمون الدوبامين يسبب؟",
    options: [
      "ADHD",
      "باركنسون",
      "اكتئاب",
      "فصام"
    ],
    correctAnswer: 1
  },
  {
    id: 17,
    question: "مرض باركنسون هو نقص في هرمون؟",
    options: [
      "التستيرون",
      "الدوبامين",
      "هرمون الذكورة",
      "العصب السابع"
    ],
    correctAnswer: 1
  },
  {
    id: 18,
    question: "ليفودوبا دواء يستخدم لـ؟",
    options: [
      "باركنسون",
      "الاكتئاب الجسيم",
      "نقص هرمون الغدة الكظرية",
      "زيادة الدوبامين"
    ],
    correctAnswer: 0
  },
  {
    id: 19,
    question: "الليثيوم دواء يستخدم لـ؟",
    options: [
      "تلف الفص الصدغي",
      "زيادة هرمون الاستروجين",
      "اضطراب ثنائي القطب",
      "اضطراب أحادي القطب"
    ],
    correctAnswer: 2
  },
  {
    id: 20,
    question: "ما المسؤول عن تكوين وتخزين الذكريات الصريحة؟",
    options: [
      "الحصين",
      "المخيخ",
      "الدماغ",
      "اللوزة"
    ],
    correctAnswer: 0
  },
  {
    id: 21,
    question: "ما الجزء المسؤول عن المعالجة العاطفية خاصة المرتبطة بالخوف؟",
    options: [
      "الفص القذالي",
      "اللوزة",
      "بروكا",
      "الذاكرة قصيرة المدى"
    ],
    correctAnswer: 1
  },
  {
    id: 22,
    question: "مريض منصبه عالٍ يتجنب الناس ويحب العزلة، ما التشخيص؟",
    options: [
      "اضطراب شخصية تجنبية",
      "اضطراب القلق المعمم",
      "رهاب اجتماعي",
      "قلق وتوتر"
    ],
    correctAnswer: 0
  },
  {
    id: 23,
    question: "رجل عمره 45 يحب أن يراه الآخرون مثاليًا ولا يتحمل النقد، ما التشخيص؟",
    options: [
      "اضطراب ما بعد الصدمة",
      "شخصية نرجسية",
      "شخصية حدية",
      "شخصية مثالية"
    ],
    correctAnswer: 1
  },
  {
    id: 24,
    question: "فتاة تريد ترك التدخين، ما المرحلة حسب نظرية فرويد؟",
    options: [
      "المرحلة الفمية",
      "المرحلة الشرجية",
      "الكمون",
      "المراهقة"
    ],
    correctAnswer: 0
  },
  {
    id: 25,
    question: "طفل يخاف من العناكب، فوضع والده عنكبوتًا على يده فجأة، ما التقنية المستخدمة؟",
    options: [
      "الغمر",
      "التدليل",
      "علاج سلوكي معرفي",
      "التهيئة"
    ],
    correctAnswer: 0
  },
  {
    id: 26,
    question: "طفل لا يتكلم ولا يتفاعل اجتماعياً ويكرر حركات نمطية، ما هو التشخيص المرجح؟",
    options: [
      "اضطراب التواصل",
      "اضطراب طيف التوحد",
      "اضطراب فرط الحركة وتشتت الانتباه",
      "اضطراب اللغة التعبيرية"
    ],
    correctAnswer: 1
  },
  {
    id: 27,
    question: "أخصائي لاحظ أن أحد المرضى لديه أعراض اكتئاب منذ سنتين بدون انقطاع. ما هو التشخيص؟",
    options: [
      "اضطراب اكتئابي جسيم",
      "اضطراب اكتئابي مستمر (عسر المزاج)",
      "اضطراب وجداني ثنائي القطب",
      "اضطراب ما بعد الصدمة"
    ],
    correctAnswer: 1
  },
  {
    id: 28,
    question: "مراجع يعاني من تقلبات مزاجية بين الحزن الشديد والفرح الشديد مع اندفاعية. ما التشخيص؟",
    options: [
      "اضطراب وجداني ثنائي القطب",
      "اضطراب الشخصية الحدية",
      "اكتئاب موسمي",
      "اضطراب القلق العام"
    ],
    correctAnswer: 0
  },
  {
    id: 29,
    question: "طفل لديه ضعف في الانتباه وفرط في النشاط وعدم استقرار سلوكي، ما التشخيص؟",
    options: [
      "اضطراب طيف التوحد",
      "اضطراب سلوكي",
      "اضطراب فرط الحركة وتشتت الانتباه (ADHD)",
      "اضطراب التعلم"
    ],
    correctAnswer: 2
  },
  {
    id: 30,
    question: "مريضة لديها نوبات فزع متكررة مفاجئة يصاحبها خفقان وتعرق وخوف من الموت. ما التشخيص؟",
    options: [
      "اضطراب قلق عام",
      "اضطراب الهلع (Panic Disorder)",
      "رهاب اجتماعي",
      "وسواس قهري"
    ],
    correctAnswer: 1
  },
  {
    id: 31,
    question: "فتاة تشعر بخوف شديد من التحدث أمام الجمهور رغم قدرتها العقلية الجيدة، ما المشكلة؟",
    options: [
      "اضطراب الشخصية الانطوائية",
      "قلق اجتماعي",
      "قلق عام",
      "رهاب محدد"
    ],
    correctAnswer: 1
  },
  {
    id: 32,
    question: "شخص يغسل يديه عشرات المرات في اليوم رغم عدم وجود مبرر واضح. ما التشخيص؟",
    options: [
      "اضطراب وسواسي قهري",
      "فوبيا النظافة",
      "اضطراب قلق عام",
      "اضطراب ما بعد الصدمة"
    ],
    correctAnswer: 0
  },
  {
    id: 33,
    question: "عميل تعرض لحادث سيارة وأصبح يعاني من كوابيس متكررة وقلق دائم. ما التشخيص؟",
    options: [
      "اضطراب القلق العام",
      "اضطراب ما بعد الصدمة (PTSD)",
      "اضطراب الاكتئاب الجسيم",
      "الفصام"
    ],
    correctAnswer: 1
  },
  {
    id: 34,
    question: "ما الجزء من الدماغ المسؤول عن تنسيق الحركة التوازن؟",
    options: [
      "الحصين",
      "اللوزة",
      "المخيخ",
      "النخاع"
    ],
    correctAnswer: 2
  },
  {
    id: 35,
    question: "أخصائي لاحظ أن العميل يعاني من صعوبة في التذكر والتعلم والتركيز بعد إصابة دماغية. ما التشخيص؟",
    options: [
      "اضطراب معرفي خفيف",
      "اضطراب معرفي كبير",
      "خرف الشيخوخة",
      "فصام"
    ],
    correctAnswer: 1
  },
  {
    id: 36,
    question: "أب يسأل عن أنسب طريقة لتعزيز السلوك الإيجابي لدى طفله؟",
    options: [
      "التعزيز الإيجابي",
      "العقاب السلبي",
      "الإهمال المتعمد",
      "النمذجة السلبية"
    ],
    correctAnswer: 0
  },
  {
    id: 37,
    question: "مريض يظن أن الآخرين يراقبونه ويضحكون عليه دون سبب واضح. ما التشخيص؟",
    options: [
      "اضطراب الشخصية المرتابة",
      "اضطراب ذهاني",
      "اضطراب القلق",
      "اضطراب وجداني"
    ],
    correctAnswer: 1
  },
  {
    id: 38,
    question: "طفلة تعاني من صعوبة نطق الحروف وعدم وضوح الكلام، ما نوع الاضطراب؟",
    options: [
      "اضطراب في النطق",
      "اضطراب في اللغة",
      "اضطراب تعلم",
      "اضطراب طيف التوحد"
    ],
    correctAnswer: 0
  },
  {
    id: 39,
    question: "أخصائي يريد تقييم الذكاء اللفظي وغير اللفظي لطفل، أي مقياس يستخدم؟",
    options: [
      "بينيه",
      "وكسلر للأطفال",
      "ستانفورد",
      "مقياس الميول"
    ],
    correctAnswer: 1
  },
  {
    id: 40,
    question: "ما اسم مقياس يستخدم لتقييم التوافق النفسي لدى طلاب المدارس؟",
    options: [
      "مقياس اكتئاب بيك",
      "مقياس تايلور للقلق",
      "مقياس فاينلاند للتوافق",
      "مقياس وكسلر"
    ],
    correctAnswer: 2
  },
  {
    id: 41,
    question: "ما اسم الاختبار الذي يعتمد على تفسير بقع حبر؟",
    options: [
      "اختبار تفكير إبداعي",
      "اختبار رورشاخ",
      "اختبار TAT",
      "اختبار بندر"
    ],
    correctAnswer: 1
  },
  {
    id: 42,
    question: "الوظيفة التنفيذية المرتبطة بالتخطيط والتنظيم تقع في أي جزء من الدماغ؟",
    options: [
      "الفص الجبهي",
      "الفص القذالي",
      "المخيخ",
      "النخاع الشوكي"
    ],
    correctAnswer: 0
  },
  {
    id: 43,
    question: "طفل يتهرب من المدرسة دون سبب منطقي، ما التفسير المرجح؟",
    options: [
      "صدمة عاطفية",
      "اضطراب قلق الانفصال",
      "سلوك عدواني",
      "اضطراب نرجسي"
    ],
    correctAnswer: 1
  },
  {
    id: 44,
    question: "أي مما يلي مثال على تعزيز إيجابي؟",
    options: [
      "إعطاء مكافأة بعد أداء جيد",
      "منع الطفل من اللعب",
      "تجاهل الطفل",
      "حرمان الطفل من المصروف"
    ],
    correctAnswer: 0
  },
  {
    id: 45,
    question: "عندما يقوم الطفل بسلوك سلبي ويتم تجاهله، ما نوع الأسلوب المستخدم؟",
    options: [
      "تعزيز إيجابي",
      "تعزيز سلبي",
      "عقاب سلبي",
      "إطفاء"
    ],
    correctAnswer: 3
  },
  {
    id: 46,
    question: "أم لاحظت أن طفلها يكرر كلمات الآخرين فور سماعها. ما هذا السلوك؟",
    options: [
      "متلازمة داون",
      "الترديد (Echolalia)",
      "طيف التوحد",
      "فرط حركة"
    ],
    correctAnswer: 1
  },
  {
    id: 47,
    question: "العلاج المعرفي السلوكي يعتمد على؟",
    options: [
      "تغيير المشاعر",
      "تعديل التفكير والسلوك",
      "العقاقير",
      "التدخل الجراحي"
    ],
    correctAnswer: 1
  },
  {
    id: 48,
    question: "مريض لديه هلاوس سمعية، ما النوع المحتمل من الاضطراب؟",
    options: [
      "اضطراب وسواسي",
      "اضطراب وجداني",
      "اضطراب ذهاني",
      "اضطراب قلق"
    ],
    correctAnswer: 2
  },
  {
    id: 49,
    question: "أي مما يلي يمثل سلوكًا غير تكيفي؟",
    options: [
      "تأجيل المهام باستمرار",
      "الحزم في المواقف",
      "التعبير عن المشاعر بوضوح",
      "احترام الذات"
    ],
    correctAnswer: 0
  },
  {
    id: 50,
    question: "عندما يُطلب من شخص تذكر قائمة كلمات بعد قراءتها مرة واحدة، ما نوع الذاكرة المستخدمة؟",
    options: [
      "الذاكرة الحسية",
      "الذاكرة قصيرة المدى",
      "الذاكرة طويلة المدى",
      "الذاكرة الإجرائية"
    ],
    correctAnswer: 1
  },
  {
    id: 51,
    question: "ما نوع التعلم الذي يحدث من خلال الملاحظة والتقليد؟",
    options: [
      "التعلم الإجرائي",
      "التعلم الاجتماعي",
      "التعلم الشرطي الكلاسيكي",
      "التعلم الشرطي الإجرائي"
    ],
    correctAnswer: 1
  },
  {
    id: 52,
    question: "أي مما يلي يعد من تقنيات العلاج السلوكي؟",
    options: [
      "الغمر",
      "التأمل",
      "التفكير العميق",
      "إعادة الصياغة"
    ],
    correctAnswer: 0
  },
  {
    id: 53,
    question: "الطالب الذي يتجنب حل الواجب لأنه يخشى الفشل يعاني من؟",
    options: [
      "انخفاض الدافعية",
      "قلق الأداء",
      "خوف من النجاح",
      "اعتماد على الآخرين"
    ],
    correctAnswer: 1
  },
  {
    id: 54,
    question: "أي مما يلي يعد سلوكًا عدوانيًا سلبيًا؟",
    options: [
      "العنف الجسدي",
      "التجاهل والتأجيل المتعمد",
      "الصراخ",
      "تهديد مباشر"
    ],
    correctAnswer: 1
  },
  {
    id: 55,
    question: "عندما يتكرر السلوك بعد زوال المعزز، فهذا يشير إلى؟",
    options: [
      "التعود",
      "الإطفاء",
      "الاسترجاع التلقائي",
      "التعميم"
    ],
    correctAnswer: 2
  },
  {
    id: 56,
    question: "ما المصطلح الذي يصف تعميم الاستجابة على مواقف مشابهة؟",
    options: [
      "التمييز",
      "التعزيز",
      "التكرار",
      "التعميم"
    ],
    correctAnswer: 3
  },
  {
    id: 57,
    question: "عندما يتم تقديم محفز ممتع مباشرة بعد السلوك، فهذا يسمى؟",
    options: [
      "تعزيز سلبي",
      "تعزيز إيجابي",
      "عقاب إيجابي",
      "عقاب سلبي"
    ],
    correctAnswer: 1
  },
  {
    id: 58,
    question: "ما وظيفة الجهاز العصبي السمبثاوي؟",
    options: [
      "0. يهدئ الجسم بعد الاستجابة للضغط",
      "1. ينشط استجابات القتال أو الهروب",
      "2. يتحكم في النوم فقط",
      "3. ينظم درجة الحرارة"
    ],
    correctAnswer: 1
  },
  {
    id: 59,
    question: "طفل يتعرض للضرب كلما تأخر عن النوم، ومع الوقت أصبح ينام مبكرًا. هذا مثال على؟",
    options: [
      "0. تعزيز إيجابي",
      "1. تعزيز سلبي",
      "2. عقاب إيجابي",
      "3. إطفاء"
    ],
    correctAnswer: 2
  },
  {
    id: 60,
    question: "ماذا يحدث عند تحفيز الجهاز الباراسمبثاوي؟",
    options: [
      "0. زيادة ضربات القلب",
      "1. اتساع حدقة العين",
      "2. استرخاء الجسم",
      "3. زيادة التوتر"
    ],
    correctAnswer: 2
  },
  {
    id: 61,
    question: "عندما يرتبط صوت معين بحدث مزعج فيتجنبه الشخص لاحقًا، فهذا يسمى؟",
    options: [
      "0. الإطفاء",
      "1. التكيف",
      "2. التكييف الكلاسيكي",
      "3. الاسترجاع"
    ],
    correctAnswer: 2
  },
  {
    id: 62,
    question: "في اختبار ستانفورد-بينيه، ما يتم قياسه أساسًا هو؟",
    options: [
      "0. الذكاء العملي",
      "1. الذكاء الاجتماعي",
      "2. الذكاء العام",
      "3. الذكاء العاطفي"
    ],
    correctAnswer: 2
  },
  {
    id: 63,
    question: "الأم التي تعاقب طفلها فور قيامه بسلوك غير مرغوب فيه تستخدم؟",
    options: [
      "0. تعزيز إيجابي",
      "1. تعزيز سلبي",
      "2. عقاب إيجابي",
      "3. إطفاء"
    ],
    correctAnswer: 2
  },
  {
    id: 64,
    question: "أي من هذه الفرضيات تتبع مدرسة التحليل النفسي؟",
    options: [
      "0. السلوك ناتج عن دوافع لاشعورية",
      "1. السلوك نتيجة للتعلم",
      "2. السلوك انعكاس مباشر للبيئة",
      "3. السلوك موروث جينيًا فقط"
    ],
    correctAnswer: 0
  },
  {
    id: 65,
    question: "في نظرية بافلوف، ما هو المثير المحايد؟",
    options: [
      "0. الطعام",
      "1. اللعاب",
      "2. الجرس",
      "3. الضوء"
    ],
    correctAnswer: 2
  },
  {
    id: 66,
    question: "أي مما يلي من مظاهر القلق المعرفي؟",
    options: [
      "0. التعرق",
      "1. التفكير الزائد",
      "2. ارتجاف العضلات",
      "3. زيادة ضربات القلب"
    ],
    correctAnswer: 1
  },
  {
    id: 67,
    question: "ما الجهاز العصبي المسؤول عن التفكير الواعي؟",
    options: [
      "0. الجهاز الطرفي",
      "1. الجهاز السمبثاوي",
      "2. الجهاز المركزي",
      "3. الجهاز الباراسمبثاوي"
    ],
    correctAnswer: 2
  },
  {
    id: 68,
    question: "طفل يتم تعزيزه كل ثالث مرة يقوم بها بسلوك جيد. ما نوع التعزيز؟",
    options: [
      "0. تعزيز مستمر",
      "1. تعزيز متقطع ثابت النسبة",
      "2. تعزيز متغير",
      "3. تعزيز زمني"
    ],
    correctAnswer: 1
  },
  {
    id: 69,
    question: "أي مما يلي ليس من خصائص النمو المعرفي حسب بياجيه؟",
    options: [
      "0. التكيف",
      "1. الاستيعاب",
      "2. الانتباه الانتقائي",
      "3. التوازن"
    ],
    correctAnswer: 2
  },
  {
    id: 70,
    question: "في مرحلة العمليات المادية الملموسة، يكون الطفل قادرًا على؟",
    options: [
      "0. التفكير المجرد",
      "1. استخدام الرموز",
      "2. فهم حفظ الكمية",
      "3. التفكير الأخلاقي"
    ],
    correctAnswer: 2
  },
  {
    id: 71,
    question: "طفل يستطيع فهم أن الكمية لا تتغير رغم تغير الشكل. هذا يدل على؟",
    options: [
      "0. الانتباه",
      "1. الاستيعاب",
      "2. حفظ الكمية",
      "3. التكيّف"
    ],
    correctAnswer: 2
  },
  {
    id: 72,
    question: "المرحلة التي يظهر فيها الطفل خيالاً واسعًا وقدرة على التقليد؟",
    options: [
      "0. ما قبل العمليات",
      "1. الحسية الحركية",
      "2. الملموسة",
      "3. المجردة"
    ],
    correctAnswer: 0
  },
  {
    id: 73,
    question: "عند تعلم استجابتين في موقفين مختلفين ثم دمجهما لاستجابة جديدة، يسمى ذلك؟",
    options: [
      "0. التعلم بالاستبصار",
      "1. التكيف",
      "2. التسلسل",
      "3. التعميم"
    ],
    correctAnswer: 0
  },
  {
    id: 74,
    question: "القدرة على التفكير في الاحتمالات والفرضيات تظهر في أي مرحلة؟",
    options: [
      "0. ما قبل العمليات",
      "1. العمليات الحسية",
      "2. العمليات المجردة",
      "3. الحسية الحركية"
    ],
    correctAnswer: 2
  },
  {
    id: 75,
    question: "ما الذي يُعد دافعًا فسيولوجيًا؟",
    options: [
      "0. الحاجة للتقدير",
      "1. الحاجة للأمان",
      "2. الجوع",
      "3. النجاح"
    ],
    correctAnswer: 2
  },
 
{
    id: 76,
    question: "أي من التالي يُعد دافعًا نفسيًا؟",
    options: [
      "0. العطش",
      "1. الحاجة للإنجاز",
      "2. الجوع",
      "3. النوم"
    ],
    correctAnswer: 1
  },
  {
    id: 77,
    question: "ما نوع الدافع المرتبط بالحفاظ على البقاء؟",
    options: [
      "0. الدافع الاجتماعي",
      "1. الدافع الفسيولوجي",
      "2. الدافع المعرفي",
      "3. الدافع التحفيزي"
    ],
    correctAnswer: 1
  },
  {
    id: 78,
    question: "عندما يشعر الطالب بالرضا بعد تحقيق هدفه الدراسي، فإن ذلك يعكس؟",
    options: [
      "0. تعزيز خارجي",
      "1. دافع فسيولوجي",
      "2. تعزيز داخلي",
      "3. إطفاء"
    ],
    correctAnswer: 2
  },
  {
    id: 79,
    question: "حسب هرم ماسلو، ما الحاجة التي تأتي بعد الحاجات الفسيولوجية؟",
    options: [
      "0. الحاجة للتقدير",
      "1. الحاجة للأمان",
      "2. الحاجة للانتماء",
      "3. تحقيق الذات"
    ],
    correctAnswer: 1
  },
  {
    id: 80,
    question: "الطالب الذي يذاكر لأنه يحب النجاح لديه؟",
    options: [
      "0. دافع خارجي",
      "1. دافع مادي",
      "2. دافع داخلي",
      "3. دافع بيولوجي"
    ],
    correctAnswer: 2
  },
  {
    id: 81,
    question: "أي من العوامل التالية يُعد مثبطًا للدافعية؟",
    options: [
      "0. التشجيع المستمر",
      "1. وضوح الأهداف",
      "2. الفشل المتكرر",
      "3. النجاح المتتالي"
    ],
    correctAnswer: 2
  },
  {
    id: 82,
    question: "من وسائل زيادة الدافعية للإنجاز؟",
    options: [
      "0. العقاب",
      "1. المنافسة غير المنظمة",
      "2. التشجيع والتعزيز",
      "3. تقليل التوقعات"
    ],
    correctAnswer: 2
  },
  {
    id: 83,
    question: "في أي مرحلة يكون الفرد أكثر عرضة لتكوين الهوية الذاتية؟",
    options: [
      "0. الطفولة المبكرة",
      "1. الطفولة المتأخرة",
      "2. المراهقة",
      "3. الرشد"
    ],
    correctAnswer: 2
  },
  {
    id: 84,
    question: "ما هي النظرية التي تفسر التعلم من خلال ربط مثير بمثير آخر؟",
    options: [
      "0. التعلم الاجتماعي",
      "1. الاشتراط الإجرائي",
      "2. الاشتراط الكلاسيكي",
      "3. النظرية المعرفية"
    ],
    correctAnswer: 2
  },
  {
    id: 85,
    question: "أي من هذه الحاجات يقع في قمة هرم ماسلو؟",
    options: [
      "0. الحاجات الفسيولوجية",
      "1. الحاجة للأمان",
      "2. الحاجة للتقدير",
      "3. تحقيق الذات"
    ],
    correctAnswer: 3
  },
  {
    id: 86,
    question: "عندما يرفض طفل الذهاب إلى المدرسة بسبب الانفصال عن الأم، فإنه يعاني من؟",
    options: [
      "0. الرهاب الاجتماعي",
      "1. اضطراب التعلق",
      "2. اضطراب قلق الانفصال",
      "3. اضطراب سلوكي"
    ],
    correctAnswer: 2
  },
  {
    id: 87,
    question: "ما اسم المرحلة التي يظهر فيها الطفل قدرات التخيل واللعب الرمزي؟",
    options: [
      "0. الحسية الحركية",
      "1. ما قبل العمليات",
      "2. العمليات الملموسة",
      "3. العمليات المجردة"
    ],
    correctAnswer: 1
  },
  {
    id: 88,
    question: "أي من التالي يُعتبر دافعًا اجتماعيًا؟",
    options: [
      "0. النوم",
      "1. الانتماء",
      "2. العطش",
      "3. الجوع"
    ],
    correctAnswer: 1
  },
  {
    id: 89,
    question: "في نظرية إريكسون، التحدي الرئيسي في مرحلة المراهقة هو؟",
    options: [
      "0. الثقة مقابل الشك",
      "1. المبادرة مقابل الذنب",
      "2. الهوية مقابل تمييع الدور",
      "3. الإنتاج مقابل الركود"
    ],
    correctAnswer: 2
  },
  {
    id: 90,
    question: "أي مما يلي مثال على التعلم بالملاحظة؟",
    options: [
      "0. طفل يقلد والده في ارتداء الحذاء",
      "1. طالب يكرر الكلمات للحفظ",
      "2. شخص يربط الجرس بالطعام",
      "3. فأر يضغط زرًا للحصول على طعام"
    ],
    correctAnswer: 0
  },
  {
    id: 91,
    question: "التفكير الناقد يشمل؟",
    options: [
      "0. التذكر فقط",
      "1. التحليل والتقويم",
      "2. الحفظ والاسترجاع",
      "3. الفهم فقط"
    ],
    correctAnswer: 1
  },
  {
    id: 92,
    question: "عندما يُعرض على الطالب حافز سلبي ليزداد الأداء، ما نوع الدافعية؟",
    options: [
      "0. داخلية",
      "1. خارجية",
      "2. معرفية",
      "3. اجتماعية"
    ],
    correctAnswer: 1
  },
  {
    id: 93,
    question: "الأخصائي النفسي يستخدم الاختبارات النفسية لـ؟",


options: [
      "0. إصدار الأحكام القضائية",
      "1. التشخيص والتوجيه",
      "2. العقاب",
      "3. العلاج الجراحي"
    ],
    correctAnswer: 1
  },
  {
    id: 94,
    question: "أي من التالي يُعد من الاختبارات الإسقاطية؟",
    options: [
      "0. وكسلر",
      "1. بندر",
      "2. رورشاخ",
      "3. ستانفورد"
    ],
    correctAnswer: 2
  },
  {
    id: 95,
    question: "مقياس بيك يُستخدم لقياس؟",
    options: [
      "0. الذكاء",
      "1. الاكتئاب",
      "2. العدوان",
      "3. الإبداع"
    ],
    correctAnswer: 1
  },
  {
    id: 96,
    question: "عندما يُعطي الطالب إجابة صحيحة ويتم تعزيزه فورًا، ما نوع التعزيز؟",
    options: [
      "0. تعزيز متأخر",
      "1. تعزيز مباشر",
      "2. تعزيز متقطع",
      "3. تعزيز سلبي"
    ],
    correctAnswer: 1
  },
  {
    id: 97,
    question: "طفل خجول في المدرسة ولا يشارك. أفضل أسلوب لدعمه؟",
    options: [
      "0. النقد",
      "1. التجاهل",
      "2. التعزيز الإيجابي",
      "3. العقاب"
    ],
    correctAnswer: 2
  },
  {
    id: 98,
    question: "مرحلة المراهقة تقع بين الأعمار؟",
    options: [
      "0. 6–12",
      "1. 13–18",
      "2. 19–25",
      "3. 3–6"
    ],
    correctAnswer: 1
  },
  {
    id: 99,
    question: "الاختبارات التي تقيس الاستعداد والقدرة العقلية تُسمى؟",
    options: [
      "0. اختبارات تحصيلية",
      "1. اختبارات إبداعية",
      "2. اختبارات الذكاء",
      "3. اختبارات نفسية إسقاطية"
    ],
    correctAnswer: 2
  },
  {
    id: 100,
    question: "ما اسم المرحلة التي يظهر فيها التفكير المجرد؟",
    options: [
      "0. الحسية الحركية",
      "1. الملموسة",
      "2. ما قبل العمليات",
      "3. العمليات الصورية (المجردة)"
    ],
    correctAnswer: 3
  },
{
    id: 101,
    question: "ما نوع الذاكرة التي تخزن المعلومات لفترة قصيرة جدًا وتتعامل مع الحواس؟",
    options: [
      "0. الذاكرة الحسية",
      "1. الذاكرة قصيرة المدى",
      "2. الذاكرة طويلة المدى",
      "3. الذاكرة العاملة"
    ],
    correctAnswer: 0
  },
  {
    id: 102,
    question: "التشخيص الذي يصف خوفًا مفرطًا غير مبرر من أشياء أو مواقف معينة؟",
    options: [
      "0. الاكتئاب",
      "1. الرهاب",
      "2. الفصام",
      "3. الوسواس"
    ],
    correctAnswer: 1
  },
  {
    id: 103,
    question: "ما الجزء المسؤول عن الوظائف التنفيذية كالتركيز والتخطيط؟",
    options: [
      "0. الفص الجداري",
      "1. الفص القذالي",
      "2. الفص الجبهي",
      "3. المخيخ"
    ],
    correctAnswer: 2
  },
  {
    id: 104,
    question: "أي مما يلي يُعد اختبارًا إسقاطيًا؟",
    options: [
      "0. اختبار وكسلر",
      "1. اختبار المصفوفات المتتابعة",
      "2. اختبار TAT",
      "3. اختبار بيك"
    ],
    correctAnswer: 2
  },
  {
    id: 105,
    question: "أي مما يلي مثال على اضطراب وجداني؟",
    options: [
      "0. القلق",
      "1. ثنائي القطب",
      "2. الرهاب",
      "3. الوسواس القهري"
    ],
    correctAnswer: 1
  },
  {
    id: 106,
    question: "ما تعريف الفصام؟",
    options: [
      "0. اضطراب قلق",
      "1. اضطراب سلوكي",
      "2. اضطراب في التفكير والإدراك",
      "3. اضطراب في المزاج"
    ],
    correctAnswer: 2
  },
  {
    id: 107,
    question: "طفل لا ينظر في عين الآخرين ويتحدث عن نفسه بصيغة الغائب، ما الاحتمال الأكبر؟",
    options: [
      "0. اضطراب لغوي",
      "1. تأخر نمائي",
      "2. طيف التوحد",
      "3. فرط حركة"
    ],
    correctAnswer: 2
  },
  {
    id: 108,
    question: "مقياس فاينلاند يُستخدم لقياس؟",
    options: [
      "0. الذكاء الانفعالي",
      "1. التوافق النفسي والاجتماعي",
      "2. التفكير الإبداعي",
      "3. الفصام"
    ],
    correctAnswer: 1
  },
  {
    id: 109,
    question: "أي مما يلي يُعد وظيفة معرفية؟",
    options: [
      "0. التذكر",
      "1. القلق",
      "2. المزاج",
      "3. العاطفة"
    ],
    correctAnswer: 0
  },
  {
    id: 110,
    question: "ما نوع المعزز الذي يُقدم بعد فترة زمنية محددة؟",
    options: [
      "0. معزز نسبي",
      "1. معزز ثابت",
      "2. معزز زمني ثابت",
      "3. معزز زمني متغير"
    ],
    correctAnswer: 2
  },
  {
    id: 111,
    question: "عندما يتعلم الشخص من نتائج أفعاله، هذا يسمى؟",
    options: [
      "0. التعلم بالملاحظة",
      "1. الاشتراط الكلاسيكي",
      "2. الاشتراط الإجرائي",
      "3. الإدراك الحسي"
    ],
    correctAnswer: 2
  },
  {
    id: 112,
    question: "ما نوع الشخصية التي تميل للعزلة ولا ترغب بالعلاقات الاجتماعية؟",
    options: [
      "0. النرجسية",
      "1. الفصامية",
      "2. الحدية",
      "3. التجنبية"
    ],
    correctAnswer: 1
  },
  {
    id: 113,
    question: "العلاج الذي يركز على الأفكار والسلوك يُسمى؟",
    options: [
      "0. التحليل النفسي",
      "1. العلاج السلوكي",
      "2. العلاج المعرفي السلوكي",
      "3. العلاج الدوائي"
    ],
    correctAnswer: 2
  },
  {
    id: 114,
    question: "ما هي أولى مراحل النمو في نظرية بياجيه؟",
    options: [
      "0. الحسية الحركية",
      "1. ما قبل العمليات",
      "2. العمليات الملموسة",
      "3. العمليات الصورية"
    ],
    correctAnswer: 0
  },
  {
    id: 115,
    question: "اضطراب نقص الانتباه وفرط الحركة يتضمن؟",
    options: [
      "0. عدم الاستجابة",
      "1. العدوانية",
      "2. صعوبات في التركيز والنشاط الزائد",
      "3. الخجل الزائد"
    ],
    correctAnswer: 2
  },
  {
    id: 116,
    question: "ما هي السمة الأساسية لاضطراب الوسواس القهري؟",
    options: [
      "0. النسيان",
      "1. الهلاوس",
      "2. الأفكار التسلطية والسلوكيات القهرية",
      "3. العزلة"
    ],
    correctAnswer: 2
  },
  {
    id: 117,
    question: "الطفل الذي يواجه صعوبة في نطق بعض الأصوات يعاني من؟",
    options: [
      "0. اضطراب في الصوت",
      "1. اضطراب في الطلاقة",
      "2. اضطراب في النطق",
      "3. اضطراب في اللغة"
    ],
    correctAnswer: 2
  },
  {
    id: 118,
    question: "أي من هذه الفئات تحتاج لمقاييس تكيف؟",
    options: [
      "0. الطلاب المتفوقون فقط",
      "1. الأطفال الأيتام فقط",
"2. ذوي الاحتياجات الخاصة",
      "3. الأصحاء فقط"
    ],
    correctAnswer: 2
  },
  {
    id: 119,
    question: "أكثر الأساليب فاعلية في ضبط سلوك الأطفال؟",
    options: [
      "0. الضرب",
      "1. التعزيز الإيجابي",
      "2. الإهمال",
      "3. الصراخ"
    ],
    correctAnswer: 1
  },
  {
    id: 120,
    question: "التفكير الإبداعي يتطلب؟",
    options: [
      "0. التكرار",
      "1. التقليد",
      "2. الطلاقة والمرونة",
      "3. الحفظ"
    ],
    correctAnswer: 2
  },
  {
    id: 121,
    question: "عندما يفهم الطفل أن الآخرين لديهم أفكار ومشاعر، فهذا يشير إلى؟",
    options: [
      "0. التمركز حول الذات",
      "1. نظرية العقل",
      "2. النمو المعرفي",
      "3. الذاكرة العاملة"
    ],
    correctAnswer: 1
  },
  {
    id: 122,
    question: "ما الجزء المسؤول عن التوازن الحركي في الدماغ؟",
    options: [
      "0. الحصين",
      "1. اللوزة",
      "2. المخيخ",
      "3. القشرة الجبهية"
    ],
    correctAnswer: 2
  },
  {
    id: 123,
    question: "ما الجزء المسؤول عن العواطف كالخوف؟",
    options: [
      "0. اللوزة الدماغية",
      "1. الحصين",
      "2. المخيخ",
      "3. القشرة البصرية"
    ],
    correctAnswer: 0
  },
  {
    id: 124,
    question: "أي مما يلي مثال على تعزيز سلبي؟",
    options: [
      "0. إعطاء مكافأة",
      "1. إزالة عقوبة بعد أداء جيد",
      "2. تجاهل الطفل",
      "3. إعطاء عقوبة بعد خطأ"
    ],
    correctAnswer: 1
  },
  {
    id: 125,
    question: "طفل يرفض الذهاب للمدرسة بسبب الخوف، ما نوع التدخل الأفضل؟",
    options: [
      "0. عقاب",
      "1. تعزيز سلبي",
      "2. تقنيات الاسترخاء والتعرض التدريجي",
      "3. تعزيز إيجابي مباشر"
    ],
    correctAnswer: 2
  },
{
    id: 126,
    question: "ما هو الهدف الأساسي من الاختبارات النفسية؟",
    options: [
      "0. إصدار الأحكام",
      "1. تصنيف الأفراد",
      "2. التشخيص والتوجيه",
      "3. إبعاد الأفراد غير المناسبين"
    ],
    correctAnswer: 2
  },
  {
    id: 127,
    question: "الطفل الذي يعاني من صعوبة في ربط الحروف بالكلمات لديه؟",
    options: [
      "0. اضطراب سلوكي",
      "1. اضطراب تعلم",
      "2. تأخر لغوي",
      "3. اضطراب في الانتباه"
    ],
    correctAnswer: 1
  },
  {
    id: 128,
    question: "ما نوع الشخصية التي تميل للسيطرة وحب القيادة؟",
    options: [
      "0. الشخصية التجنبية",
      "1. الشخصية النرجسية",
      "2. الشخصية الاعتمادية",
      "3. الشخصية الوسواسية"
    ],
    correctAnswer: 1
  },
  {
    id: 129,
    question: "عندما يعتقد الشخص أن الناس تضحك عليه دون سبب واضح، ما نوع الأعراض؟",
    options: [
      "0. هلاوس سمعية",
      "1. هذيان اضطهاد",
      "2. وساوس",
      "3. قلق اجتماعي"
    ],
    correctAnswer: 1
  },
  {
    id: 130,
    question: "ما الجزء الذي ينظم العمليات اللاإرادية مثل التنفس وضربات القلب؟",
    options: [
      "0. الفص الجبهي",
      "1. المخيخ",
      "2. النخاع المستطيل",
      "3. اللوزة"
    ],
    correctAnswer: 2
  },
  {
    id: 131,
    question: "أي من التالي يُعد اضطرابًا عصبيًا نمائيًا؟",
    options: [
      "0. القلق",
      "1. التوحد",
      "2. الاكتئاب",
      "3. الذهان"
    ],
    correctAnswer: 1
  },
  {
    id: 132,
    question: "الاستجابة التي تضعف تدريجياً عند عدم التعزيز تسمى؟",
    options: [
      "0. التكرار",
      "1. الإطفاء",
      "2. العقاب",
      "3. التكيف"
    ],
    correctAnswer: 1
  },
  {
    id: 133,
    question: "ما الهدف من استخدام مقياس وكسلر؟",
    options: [
      "0. تقييم التوافق النفسي",
      "1. قياس الذكاء",
      "2. تقييم الاكتئاب",
      "3. تحليل الشخصية"
    ],
    correctAnswer: 1
  },
  {
    id: 134,
    question: "ما الوظيفة الأساسية للناقل العصبي السيروتونين؟",
    options: [
      "0. الحركة",
      "1. المزاج والنوم",
      "2. الانتباه",
      "3. التخطيط"
    ],
    correctAnswer: 1
  },
  {
    id: 135,
    question: "الأم التي تدعم طفلها بعد محاولة فاشلة في حل الواجب تمارس؟",
    options: [
      "0. تعزيز إيجابي",
      "1. تعزيز سلبي",
      "2. دعم انفعالي",
      "3. عقاب إيجابي"
    ],
    correctAnswer: 2
  },
  {
    id: 136,
    question: "عند تقديم مكافأة بعد وقت معين بغض النظر عن السلوك، ما نوع التعزيز؟",
    options: [
      "0. تعزيز إيجابي",
      "1. تعزيز زمني ثابت",
      "2. تعزيز متقطع",
      "3. تعزيز سلبي"
    ],
    correctAnswer: 1
  },
  {
    id: 137,
    question: "أحد مكونات الذكاء العاطفي هو؟",
    options: [
      "0. الطلاقة",
      "1. التعاطف",
      "2. الانتباه",
      "3. القدرة الحركية"
    ],
    correctAnswer: 1
  },
  {
    id: 138,
    question: "ما الأسلوب الأفضل لتقويم سلوك عدواني عند طفل؟",
    options: [
      "0. العقاب الشديد",
      "1. النمذجة الإيجابية",
      "2. التجاهل",
      "3. الصراخ"
    ],
    correctAnswer: 1
  },
  {
    id: 139,
    question: "عندما يتعلم الطفل عبر ملاحظة سلوك والده، فإن هذا التعلم يسمى؟",
    options: [
      "0. تعلم مباشر",
      "1. تعلم إجرائي",
      "2. تعلم بالملاحظة",
      "3. تعلم غير مباشر"
    ],
    correctAnswer: 2
  },
  {
    id: 140,
    question: "ما الأداة المستخدمة لتقييم مستوى الذكاء غير اللفظي؟",
    options: [
      "0. اختبار بندر",
      "1. اختبار المصفوفات المتتابعة",
      "2. اختبار رورشاخ",
      "3. اختبار وكسلر"
    ],
    correctAnswer: 1
  },
  {
    id: 141,
    question: "ما وظيفة الناقل العصبي دوبامين؟",
    options: [
      "0. النوم فقط",
      "1. التحكم الحركي والمزاج",
      "2. التوازن",
      "3. التنفس"
    ],
    correctAnswer: 1
  },
  {
    id: 142,
    question: "الشخصية الحدية تتميز بـ؟",
    options: [
      "0. الاستقرار العاطفي",
      "1. الاندفاع وعدم استقرار العلاقات",
      "2. التنظيم العالي",
      "3. التجنب"
    ],
    correctAnswer: 1
  },
  {
    id: 143,
    question: "ما الطريقة الأنسب لتعزيز مهارة جديدة لدى طالب؟",
    options: [
      "0. العقاب",
      "1. التعزيز الإيجابي",
      "2. التجاهل",
      "3. التوبيخ"
    ],
    correctAnswer: 1
  },


{
    id: 144,
    question: "العلاج السلوكي قائم على نظرية؟",
    options: [
      "0. بافلوف",
      "1. فرويد",
      "2. إريكسون",
      "3. ماسلو"
    ],
    correctAnswer: 0
  },
  {
    id: 145,
    question: "الطفل الذي يكرر الكلمات التي يسمعها يسمى؟",
    options: [
      "0. مصاب بتلعثم",
      "1. لديه صمت اختياري",
      "2. لديه إيكولاليا",
      "3. يعاني من صعوبة تعبيرية"
    ],
    correctAnswer: 2
  },
  {
    id: 146,
    question: "ما الجزء من الدماغ المسؤول عن تكوين الذكريات؟",
    options: [
      "0. اللوزة",
      "1. الفص الجداري",
      "2. الحصين",
      "3. الفص القذالي"
    ],
    correctAnswer: 2
  },
  {
    id: 147,
    question: "ما وظيفة الفص القذالي؟",
    options: [
      "0. التفكير",
      "1. البصر",
      "2. التوازن",
      "3. السمع"
    ],
    correctAnswer: 1
  },
  {
    id: 148,
    question: "أي من التالي يُعد مثيرًا شرطيًا في تجربة بافلوف؟",
    options: [
      "0. الطعام",
      "1. اللعاب",
      "2. الجرس بعد الاقتران",
      "3. الصدمة"
    ],
    correctAnswer: 2
  },
  {
    id: 149,
    question: "في أي مرحلة يظهر التفكير المجرد وفق بياجيه؟",
    options: [
      "0. الحسية الحركية",
      "1. الملموسة",
      "2. الصورية",
      "3. ما قبل العمليات"
    ],
    correctAnswer: 2
  },
  {
    id: 150,
    question: "الشخص الذي يظن أن الإعلام يرسل له رسائل خاصة يعاني من؟",
    options: [
      "0. وسواس",
      "1. هلوسة",
      "2. ضلالات",
      "3. رهاب"
    ],
    correctAnswer: 2
  },
{
    id: 151,
    question: "الشخص الذي يعاني من تقلبات مزاجية حادة بين الاكتئاب والهوس يعاني من؟",
    options: [
      "0. اضطراب اكتئابي جسيم",
      "1. اضطراب الشخصية الحدية",
      "2. اضطراب ثنائي القطب",
      "3. اضطراب قلق عام"
    ],
    correctAnswer: 2
  },
  {
    id: 152,
    question: "من خصائص التفكير الإبداعي؟",
    options: [
      "0. التكرار",
      "1. الطلاقة والمرونة",
      "2. التقليد",
      "3. التلقين"
    ],
    correctAnswer: 1
  },
  {
    id: 153,
    question: "عند إزالة المنبه غير السار لزيادة السلوك، يكون ذلك؟",
    options: [
      "0. تعزيز إيجابي",
      "1. تعزيز سلبي",
      "2. عقاب إيجابي",
      "3. إطفاء"
    ],
    correctAnswer: 1
  },
  {
    id: 154,
    question: "الطالب الذي يدرس خوفًا من الرسوب يتأثر بـ؟",
    options: [
      "0. دافع داخلي",
      "1. دافع اجتماعي",
      "2. دافع خارجي",
      "3. دافع معرفي"
    ],
    correctAnswer: 2
  },
  {
    id: 155,
    question: "ما هو المكون الرئيس في العلاج السلوكي المعرفي؟",
    options: [
      "0. التركيز على اللاوعي",
      "1. إعادة بناء الأفكار",
      "2. العقاب",
      "3. التنويم المغناطيسي"
    ],
    correctAnswer: 1
  },
  {
    id: 156,
    question: "متى يكون الفص الجبهي أكثر نشاطًا؟",
    options: [
      "0. أثناء النوم",
      "1. أثناء التخطيط وحل المشكلات",
      "2. أثناء التوازن",
      "3. عند الخوف"
    ],
    correctAnswer: 1
  },
  {
    id: 157,
    question: "أكثر الاختبارات استخدامًا في قياس الاكتئاب؟",
    options: [
      "0. MMPI",
      "1. TAT",
      "2. BDI",
      "3. WISC"
    ],
    correctAnswer: 2
  },
  {
    id: 158,
    question: "طفل يتجنب التواصل البصري ولا يستجيب لاسمه، ما الاضطراب المحتمل؟",
    options: [
      "0. ADHD",
      "1. اضطراب اللغة",
      "2. طيف التوحد",
      "3. الاكتئاب"
    ],
    correctAnswer: 2
  },
  {
    id: 159,
    question: "ما نوع الشخصية التي تسعى للكمال بشكل مفرط؟",
    options: [
      "0. الشخصية الحدية",
      "1. الشخصية التجنبية",
      "2. الشخصية الوسواسية",
      "3. الشخصية النرجسية"
    ],
    correctAnswer: 2
  },
  {
    id: 160,
    question: "طفل يتحدث ولكن لا يفهم ما يقال له، ما المشكلة المحتملة؟",
    options: [
      "0. اضطراب اللغة الاستقبالية",
      "1. اضطراب النطق",
      "2. اضطراب الطلاقة",
      "3. اضطراب الصوت"
    ],
    correctAnswer: 0
  },
  {
    id: 161,
    question: "ما نوع الذاكرة المستخدمة لحل مسألة رياضية لحظيًا؟",
    options: [
      "0. الذاكرة الحسية",
      "1. الذاكرة طويلة المدى",
      "2. الذاكرة العاملة",
      "3. الذاكرة الدلالية"
    ],
    correctAnswer: 2
  },
  {
    id: 162,
    question: "العلاج السلوكي يستخدم بشكل كبير في علاج؟",
    options: [
      "0. الفصام",
      "1. اضطرابات الشخصية",
      "2. الرهاب",
      "3. اضطراب الهوية"
    ],
    correctAnswer: 2
  },
  {
    id: 163,
    question: "الشخص الذي يفسر الأحداث المحايدة كتهديد يعاني من؟",
    options: [
      "0. وسواس",
      "1. ضلالات",
      "2. تشوه معرفي",
      "3. اكتئاب"
    ],
    correctAnswer: 2
  },
  {
    id: 164,
    question: "من أعراض الفصام؟",
    options: [
      "0. المزاج المرتفع فقط",
      "1. الهلاوس والضلالات",
      "2. فرط الحركة",
      "3. فرط الدافعية"
    ],
    correctAnswer: 1
  },
  {
    id: 165,
    question: "عندما يربط الطفل بين الجرس والطعام، هذا مثال على؟",
    options: [
      "0. التكيف",
      "1. الاشتراط الكلاسيكي",
      "2. الاشتراط الإجرائي",
      "3. التقليد"
    ],
    correctAnswer: 1
  },
  {
    id: 166,
    question: "ما هي أداة قياس الذكاء التي تستخدم للأطفال الصغار؟",
    options: [
      "0. مقياس وكسلر للكبار",
      "1. مقياس ستانفورد",
      "2. مقياس وكسلر للأطفال",
      "3. مقياس رورشاخ"
    ],
    correctAnswer: 2
  },
  {
    id: 167,
    question: "ما وظيفة الحصين؟",
    options: [
      "0. التحكم الحركي",
      "1. تخزين الذكريات",
      "2. تنظيم الانفعالات",
      "3. التوازن"
    ],
    correctAnswer: 1
  },
  {
    id: 168,
    question: "ما نوع الاختبارات التي تقيس التوافق الشخصي؟",
    options: [
      "0. إسقاطية",
      "1. موضوعية",
      "2. معرفية",
      "3. تحصيلية"
    ],
    correctAnswer: 0
  },
  {
    id: 169,


question: "من اختبارات الشخصية الموضوعية؟",
    options: [
      "0. اختبار TAT",
      "1. اختبار MMPI",
      "2. اختبار رورشاخ",
      "3. اختبار بندر"
    ],
    correctAnswer: 1
  },
  {
    id: 170,
    question: "ما هو الأسلوب المستخدم في تعديل السلوك من خلال تقديم مثير بعد السلوك؟",
    options: [
      "0. العقاب",
      "1. التعزيز",
      "2. الإطفاء",
      "3. التجاهل"
    ],
    correctAnswer: 1
  },
  {
    id: 171,
    question: "ما أفضل أسلوب لتدريب الطفل على استخدام الحمام؟",
    options: [
      "0. الصراخ",
      "1. العقاب",
      "2. التعزيز الإيجابي",
      "3. الإهمال"
    ],
    correctAnswer: 2
  },
  {
    id: 172,
    question: "ما اسم المبدأ الذي ينص على ربط سلوك ضعيف بسلوك مرغوب؟",
    options: [
      "0. مبدأ التعزيز",
      "1. قانون الأثر",
      "2. قانون بريماك",
      "3. قانون التداعي"
    ],
    correctAnswer: 2
  },
  {
    id: 173,
    question: "ما نوع التعليم الذي يحدث عندما يرتبط مثير غير شرطي بمثير محايد؟",
    options: [
      "0. الاشتراط الإجرائي",
      "1. الاشتراط الكلاسيكي",
      "2. التعليم البنائي",
      "3. التعليم الاجتماعي"
    ],
    correctAnswer: 1
  },
  {
    id: 174,
    question: "عند ربط كلمة بمعلومة جديدة، ما نوع المعالجة؟",
    options: [
      "0. معالجة سطحية",
      "1. معالجة عشوائية",
      "2. معالجة عميقة",
      "3. معالجة آلية"
    ],
    correctAnswer: 2
  },
  {
    id: 175,
    question: "الطفل الذي يعاني من صعوبة في المهارات الأكاديمية لديه؟",
    options: [
      "0. اضطراب تعلم",
      "1. اضطراب سلوكي",
      "2. اضطراب لغوي",
      "3. اضطراب معرفي عام"
    ],
    correctAnswer: 0
  },

{
    id: 176,
    question: "عند استخدام أسلوب التعزيز الفوري في تعديل السلوك، فإن ذلك؟",
    options: [
      "0. يقلل فاعلية السلوك",
      "1. يعزز السلوك المستهدف بشكل أسرع",
      "2. يؤدي لتكرار السلوك غير المرغوب",
      "3. يؤدي لتثبيط دافعية التعلم"
    ],
    correctAnswer: 1
  },
  {
    id: 177,
    question: "أحد مظاهر اضطراب القلق هو؟",
    options: [
      "0. الهلاوس",
      "1. التفكير المشوش",
      "2. التوتر الجسدي",
      "3. الذهان"
    ],
    correctAnswer: 2
  },
  {
    id: 178,
    question: "الطريقة الأفضل للتعامل مع سلوك غير مرغوب فيه لدى الطفل؟",
    options: [
      "0. العقاب الجسدي",
      "1. التعزيز العكسي",
      "2. الإطفاء والتجاهل",
      "3. الصراخ والانفعال"
    ],
    correctAnswer: 2
  },
  {
    id: 179,
    question: "عند تقديم سؤال مفتوح في جلسة نفسية، الهدف منه؟",
    options: [
      "0. إجبار العميل على إجابة محددة",
      "1. قياس الذكاء",
      "2. فتح المجال للتعبير",
      "3. تقليل الوقت"
    ],
    correctAnswer: 2
  },
  {
    id: 180,
    question: "الجزء المسؤول عن اللغة في الدماغ؟",
    options: [
      "0. منطقة بروكا",
      "1. اللوزة",
      "2. الحصين",
      "3. الفص القذالي"
    ],
    correctAnswer: 0
  },
  {
    id: 181,
    question: "المفهوم الذي يصف قدرة الشخص على فهم مشاعر الآخرين هو؟",
    options: [
      "0. التقدير",
      "1. التعاطف",
      "2. التقمص",
      "3. الوعي الذاتي"
    ],
    correctAnswer: 1
  },
  {
    id: 182,
    question: "من أدوات العلاج المعرفي السلوكي؟",
    options: [
      "0. التدخل الدوائي",
      "1. تحليل الأحلام",
      "2. إعادة البناء المعرفي",
      "3. اللعب الحر"
    ],
    correctAnswer: 2
  },
  {
    id: 183,
    question: "الاختبار الذي يُستخدم لفحص الذكاء اللفظي وغير اللفظي معًا هو؟",
    options: [
      "0. بندر",
      "1. وكسلر",
      "2. MMPI",
      "3. رورشاخ"
    ],
    correctAnswer: 1
  },
  {
    id: 184,
    question: "الذاكرة التي تستمر لثوانٍ معدودة تسمى؟",
    options: [
      "0. طويلة المدى",
      "1. الحسية",
      "2. العاملة",
      "3. الدلالية"
    ],
    correctAnswer: 1
  },
  {
    id: 185,
    question: "نوع السلوك الذي يُظهره الطفل لجذب الانتباه بشكل سلبي؟",
    options: [
      "0. عدواني مباشر",
      "1. تجنبي",
      "2. سلبي عدواني",
      "3. انطوائي"
    ],
    correctAnswer: 2
  },
  {
    id: 186,
    question: "أفضل طريقة لتقوية المهارات الاجتماعية لدى الأطفال؟",
    options: [
      "0. العزلة",
      "1. العقاب",
      "2. النمذجة والتعزيز",
      "3. التوبيخ"
    ],
    correctAnswer: 2
  },
  {
    id: 187,
    question: "ما هو المقصود بالتعزيز المتغير؟",
    options: [
      "0. تعزيز ثابت بعد عدد استجابات محدد",
      "1. تعزيز بعد وقت محدد",
      "2. تعزيز بعد عدد استجابات غير متوقع",
      "3. تعزيز سلبي دائم"
    ],
    correctAnswer: 2
  },
  {
    id: 188,
    question: "طفل يكرر عبارة معينة دون ارتباط بالموقف. هذا يُسمى؟",
    options: [
      "0. صمت اختياري",
      "1. إيكولاليا",
      "2. صعوبة لغوية",
      "3. اضطراب سلوكي"
    ],
    correctAnswer: 1
  },
  {
    id: 189,
    question: "المرحلة التي يظهر فيها فهم الطفل لمفهوم حفظ الكمية؟",
    options: [
      "0. ما قبل العمليات",
      "1. العمليات الملموسة",
      "2. العمليات المجردة",
      "3. الحسية الحركية"
    ],
    correctAnswer: 1
  },
  {
    id: 190,
    question: "عند قياس القدرة على التفكير المنطقي، نستخدم؟",
    options: [
      "0. اختبارات الإبداع",
      "1. اختبارات الذكاء",
      "2. الاختبارات الإسقاطية",
      "3. ملاحظات الميدان"
    ],
    correctAnswer: 1
  },
  {
    id: 191,
    question: "في نموذج ماسلو، الحاجة للأمن تقع في؟",
    options: [
      "0. القاعدة",
      "1. بعد الحاجات الفسيولوجية",
      "2. أعلى الهرم",
      "3. لا توجد في النموذج"
    ],
    correctAnswer: 1
  },
  {
    id: 192,
    question: "أي من التالي يمثل سلوكًا تكيفيًا؟",
    options: [
      "0. الانسحاب من المواقف الاجتماعية دائمًا",
      "1. مواجهة المشكلة بإيجابية",
      "2. تجاهل المشاعر باستمرار",
      "3. الانفعال المفاجئ"
    ],
    correctAnswer: 1
  },
  {
    id: 193,
    question: "الاضطراب الذي يشمل تقلبات مزاجية شديدة هو؟",
    options: [
      "0. اضطراب القلق",
"1. اضطراب ثنائي القطب",
      "2. الوسواس القهري",
      "3. الاكتئاب المستمر"
    ],
    correctAnswer: 1
  },
  {
    id: 194,
    question: "من مؤشرات الذكاء الانفعالي؟",
    options: [
      "0. القدرة على حل المعادلات",
      "1. القدرة على التعامل مع المشاعر",
      "2. الذاكرة القوية",
      "3. الأداء الدراسي العالي"
    ],
    correctAnswer: 1
  },
  {
    id: 195,
    question: "الأداة التي تُستخدم لقياس الشخصية؟",
    options: [
      "0. مقياس الذكاء",
      "1. مقياس فاينلاند",
      "2. MMPI",
      "3. وكسلر"
    ],
    correctAnswer: 2
  },
  {
    id: 196,
    question: "الطالب الذي يتمتع بمرونة في التفكير يتميز بـ؟",
    options: [
      "0. التصلب الذهني",
      "1. التفكير الإبداعي",
      "2. ضعف التحصيل",
      "3. التبعية"
    ],
    correctAnswer: 1
  },
  {
    id: 197,
    question: "أي من الآتي يعكس مهارات تفكير عليا؟",
    options: [
      "0. التذكر",
      "1. الفهم",
      "2. التحليل والتقويم",
      "3. الحفظ"
    ],
    correctAnswer: 2
  },
  {
    id: 198,
    question: "الشخص الذي يعاني من أفكار وسواسية وسلوكيات متكررة يعاني من؟",
    options: [
      "0. اضطراب القلق",
      "1. الوسواس القهري",
      "2. الاكتئاب",
      "3. ثنائي القطب"
    ],
    correctAnswer: 1
  },
  {
    id: 199,
    question: "القدرة على فهم واستيعاب القواعد المجردة تُظهر؟",
    options: [
      "0. ضعف إدراكي",
      "1. ذكاء مجرد",
      "2. ذاكرة عمل",
      "3. انتباه انتقائي"
    ],
    correctAnswer: 1
  },
  {
    id: 200,
    question: "ما النوع المناسب من التعزيز مع الطلاب ذوي الدافعية المنخفضة؟",
    options: [
      "0. التعزيز الإيجابي المباشر",
      "1. العقاب التأديبي",
      "2. الإهمال",
      "3. الحرمان"
    ],
    correctAnswer: 0
  }
];


let currentQuestionIndex = 0;
let userAnswers = [];
let timer = null;
let timeLeft = 0;

function startQuiz() {
  currentQuestionIndex = 0;
  userAnswers = []; // Reset user answers when starting a new quiz
  showQuestion(currentQuestionIndex);
}

function showQuestion(index) {
  const question = questions[index];
  const questionContentDiv = document.getElementById('question-content'); // Target the new div
  const prevButton = document.getElementById('prevButton');
  const nextButton = document.getElementById('nextButton');
  const holdTimerBtn = document.getElementById('holdTimerBtn'); // Get the new button

  // Show/hide previous button
  prevButton.style.display = index > 0 ? 'block' : 'none';

  // Update next button text
  nextButton.textContent = index === questions.length - 1 ? 'إنهاء' : 'السؤال التالي';

  // Create question HTML
  let html = `
    <div class="question">
      <h2>السؤال ${index + 1} من ${questions.length}</h2>
      <div class="timer-container">
        <div id="timerCircle"></div>
      </div>
      <p>${question.question}</p>
      <div class="options">
  `;

  question.options.forEach((option, i) => {
    const isSelected = userAnswers[index] === i;
    const correctAnswerIndex = question.correctAnswer;
    const isCorrectOption = i === correctAnswerIndex;
    const userAnswered = userAnswers[index] !== undefined;
    
    let correctClass = '';
    let wrongClass = '';

    if (userAnswered) {
      if (isSelected && !isCorrectOption) {
        wrongClass = 'wrong'; // User selected this option, it's wrong, and question is answered
      }
      if (isCorrectOption) {
        correctClass = 'correct'; // This is the correct option, and question is answered
      }
    }

    html += `
      <label class="option ${isSelected ? 'selected' : ''} ${correctClass} ${wrongClass}">
        <input type="radio" name="answer" value="${i}" ${isSelected ? 'checked' : ''} ${userAnswered ? 'disabled' : ''}>
        <span>${option}</span>
      </label>
    `;
  });

  html += `
      </div>
    </div>
  `;

  questionContentDiv.innerHTML = html;

  // Add event listeners only if the question hasn't been answered yet
  if (userAnswers[index] === undefined) {
    const options = questionContentDiv.querySelectorAll('.option');
    options.forEach(option => {
      option.addEventListener('click', () => {
        options.forEach(opt => opt.classList.remove('selected', 'correct', 'wrong'));
        option.classList.add('selected');
        const selectedAnswer = parseInt(option.querySelector('input').value);
        userAnswers[index] = selectedAnswer;
        
        // Check if the answer is correct
        if (selectedAnswer === question.correctAnswer) {
          option.classList.add('correct'); // If correct, add 'correct' class
        } else {
          option.classList.add('wrong');
          // Show the correct answer
          options[question.correctAnswer].classList.add('correct');
        }
      });
    });
  }

  // Add event listeners for navigation buttons
  prevButton.onclick = previousQuestion;
  nextButton.onclick = () => {
    if (index === questions.length - 1) {
      showResult();
    } else {
      nextQuestion();
    }
  };

  // Timer logic
  const timePerQuestion = 10; // 10 seconds per question
  let timerPaused = false; // Flag to track timer pause state
  timeLeft = timePerQuestion;
  const timerCircle = document.getElementById('timerCircle');

  function updateTimerVisual() {
    timerCircle.textContent = timeLeft + 's';
    const percent = (timeLeft / timePerQuestion) * 100;
    timerCircle.style.setProperty('--time', percent);

    if (timeLeft <= 5) {
      timerCircle.classList.add('warning');
    } else {
      timerCircle.classList.remove('warning');
    }
    if (timeLeft <= 2) {
      timerCircle.classList.add('danger');
    } else {
      timerCircle.classList.remove('danger');
    }
  }

  function startCountdown() {
    clearInterval(timer); // Clear any existing timer
    timer = setInterval(() => {
      timeLeft--;
      updateTimerVisual();
      if (timeLeft <= 0) {
        clearInterval(timer);
        // Automatically move to the next question if time runs out
        if (index < questions.length - 1) {
          nextQuestion();
        } else {
          showResult(); // If it's the last question, show results
        }
      }
    }, 1000);
  }

  updateTimerVisual(); // Initial display
  startCountdown(); // Start the timer initially

  // Hold Timer Button functionality
  holdTimerBtn.onclick = () => {
    if (timerPaused) {
      startCountdown();
      holdTimerBtn.textContent = 'إيقاف المؤقت';
      holdTimerBtn.style.backgroundColor = '#f39c12'; // Orange color
    } else {
      clearInterval(timer);
      holdTimerBtn.textContent = 'استئناف المؤقت';
      holdTimerBtn.style.backgroundColor = 'var(--success-button-bg)'; // Use the CSS variable
    }
    timerPaused = !timerPaused;
  };
}

function previousQuestion() {
  if (currentQuestionIndex > 0) {
    // Save current answer before moving back
    const currentOptions = document.querySelectorAll('.option');
    const selectedOption = Array.from(currentOptions).find(opt => opt.classList.contains('selected'));
    if (selectedOption) {
      const selectedAnswer = parseInt(selectedOption.querySelector('input').value);
      userAnswers[currentQuestionIndex] = selectedAnswer;
    }
    
    currentQuestionIndex--;
    showQuestion(currentQuestionIndex);
  }
}

function nextQuestion() {
  if (currentQuestionIndex < questions.length - 1) {
    currentQuestionIndex++;
    showQuestion(currentQuestionIndex);
  }
}

function showResult() {
  const quizContainer = document.getElementById('quiz-container');
  const resultContainer = document.getElementById('resultContainer');
  const resultUserInfo = document.getElementById('resultUserInfo');
  const finalScore = document.getElementById('finalScore');
  
  // Get user information
  const name = localStorage.getItem('userName');
  const phone = localStorage.getItem('userPhone');
  const age = localStorage.getItem('userAge');
  
  // Calculate score
  const totalQuestions = questions.length;
  const score = Math.round((userAnswers.filter((answer, index) => answer === questions[index].correctAnswer).length / totalQuestions) * 100);
  
  // Hide quiz container and show result container
  quizContainer.style.display = 'none';
  resultContainer.style.display = 'block';
  
  // Display user information and score with enhanced styling
  resultUserInfo.innerHTML = `
    <div class="user-info-card">
      <h3>معلومات الطالب</h3>
      <div class="info-item">
        <span class="label">الاسم:</span>
        <span class="value">${name}</span>
      </div>
      <div class="info-item">
        <span class="label">رقم الهاتف:</span>
        <span class="value">${phone}</span>
      </div>
      <div class="info-item">
        <span class="label">العمر:</span>
        <span class="value">${age}</span>
      </div>
    </div>
  `;
  
  // Display score with enhanced styling
  finalScore.innerHTML = `
    <div class="score-card">
      <h3>النتيجة النهائية</h3>
      <div class="score-circle">
        <span class="score-value">${score}%</span>
      </div>
      <div class="score-details">
        <p>الإجابات الصحيحة: ${userAnswers.filter((answer, index) => answer === questions[index].correctAnswer).length} من ${totalQuestions}</p>
        <p>النسبة المئوية: ${score}%</p>
      </div>
    </div>
  `;
}

// Add click animation to all buttons
document.querySelectorAll('button, .btn').forEach(button => {
    button.addEventListener('click', function() {
        this.classList.add('clicked');
        setTimeout(() => {
            this.classList.remove('clicked');
        }, 500);
    });
});

// Dark mode functionality
document.addEventListener('DOMContentLoaded', () => {
  const toggleSwitch = document.querySelector('.theme-switch input[type="checkbox"]');
  
  function switchTheme(e) {
    if (e.target.checked) {
      document.documentElement.setAttribute('data-theme', 'dark');
      localStorage.setItem('theme', 'dark');
    } else {
      document.documentElement.setAttribute('data-theme', 'light');
      localStorage.setItem('theme', 'light');
    }
  }

  toggleSwitch.addEventListener('change', switchTheme);

  // Check for saved theme preference
  const currentTheme = localStorage.getItem('theme') || 'light';
  if (currentTheme === 'dark') {
    document.documentElement.setAttribute('data-theme', 'dark');
    toggleSwitch.checked = true;
  }

  // Start the quiz when the page loads
  startQuiz();
});